{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "special": true,
      "content": "[UNK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false
    },
    {
      "id": 1,
      "special": true,
      "content": "[CLS]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false
    },
    {
      "id": 2,
      "special": true,
      "content": "[SEP]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false
    },
    {
      "id": 3,
      "special": true,
      "content": "[PAD]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false
    },
    {
      "id": 4,
      "special": true,
      "content": "[MASK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false
    }
  ],
  "normalizer": {
    "type": "Sequence",
    "normalizers": [
      {
        "type": "NFD"
      },
      {
        "type": "Lowercase"
      },
      {
        "type": "StripAccents"
      }
    ]
  },
  "pre_tokenizer": null,
  "post_processor": null,
  "decoder": null,
  "model": {
    "type": "WordPiece",
    "unk_token": "[UNK]",
    "continuing_subword_prefix": "##",
    "max_input_chars_per_word": 100,
    "vocab": {
      "[UNK]": 0,
      "[CLS]": 1,
      "[SEP]": 2,
      "[PAD]": 3,
      "[MASK]": 4,
      "\n": 5,
      " ": 6,
      "\"": 7,
      "#": 8,
      "$": 9,
      "&": 10,
      "'": 11,
      "(": 12,
      ")": 13,
      ",": 14,
      "-": 15,
      ".": 16,
      "/": 17,
      "0": 18,
      "1": 19,
      "2": 20,
      "3": 21,
      "4": 22,
      "5": 23,
      ":": 24,
      "=": 25,
      "[": 26,
      "]": 27,
      "_": 28,
      "`": 29,
      "a": 30,
      "b": 31,
      "c": 32,
      "d": 33,
      "e": 34,
      "f": 35,
      "g": 36,
      "h": 37,
      "i": 38,
      "j": 39,
      "k": 40,
      "l": 41,
      "m": 42,
      "n": 43,
      "o": 44,
      "p": 45,
      "r": 46,
      "s": 47,
      "t": 48,
      "u": 49,
      "v": 50,
      "w": 51,
      "x": 52,
      "y": 53,
      "z": 54,
      "{": 55,
      "}": 56,
      "、": 57,
      "## ": 58,
      "##}": 59,
      "##\n": 60,
      "##\"": 61,
      "##t": 62,
      "##o": 63,
      "##k": 64,
      "##e": 65,
      "##n": 66,
      "##s": 67,
      "##:": 68,
      "##r": 69,
      "##i": 70,
      "##g": 71,
      "##,": 72,
      "##/": 73,
      "##l": 74,
      "##a": 75,
      "##h": 76,
      "##f": 77,
      "##d": 78,
      "##p": 79,
      "##.": 80,
      "##m": 81,
      "##y": 82,
      "##c": 83,
      "##u": 84,
      "##、": 85,
      "##b": 86,
      "##_": 87,
      "##v": 88,
      "##w": 89,
      "##{": 90,
      "##x": 91,
      "##4": 92,
      "##[": 93,
      "##'": 94,
      "##]": 95,
      "###": 96,
      "##`": 97,
      "##0": 98,
      "##3": 99,
      "##5": 100,
      "##2": 101,
      "##&": 102,
      "##$": 103,
      "##-": 104,
      "##1": 105,
      "##j": 106,
      "##=": 107,
      "##(": 108,
      "##)": 109,
      "##z": 110,
      "##  ": 111,
      "##    ": 112,
      "##        ": 113,
      "## \"": 114,
      "         ": 115,
      "##\":": 116,
      "##   \"": 117,
      "##in": 118,
      "##,\n": 119,
      "##at": 120,
      "##\": ": 121,
      "##to": 122,
      "##       \"": 123,
      "##id": 124,
      "##ke": 125,
      "##   ": 126,
      "##toke": 127,
      "##token": 128,
      "##\": \"": 129,
      "##be": 130,
      "##dat": 131,
      "                \"": 132,
      "##data": 133,
      "                 ": 134,
      "##ig": 135,
      "##_id": 136,
      "##tr": 137,
      "##   }": 138,
      "##{\n": 139,
      "                    \"": 140,
      "##, ": 141,
      "##la": 142,
      "##bel": 143,
      "##label": 144,
      "##\",\n": 145,
      "##on": 146,
      "##or": 147,
      "##ain": 148,
      "##de": 149,
      "##pr": 150,
      "##train": 151,
      "##\": [": 152,
      "##_ids": 153,
      "##_token": 154,
      "##],\n": 155,
      "##\"、": 156,
      "##//": 157,
      "##_s": 158,
      "##igin": 159,
      "##origin": 160,
      "##\"、\"": 161,
      "##es": 162,
      "##am": 163,
      "##\": {\n": 164,
      "##\"\n": 165,
      "##ed": 166,
      "##   }\n": 167,
      "##, //": 168,
      "##ic": 169,
      "##fig": 170,
      "##ma": 171,
      "##con": 172,
      "##ing": 173,
      "##config": 174,
      "##et": 175,
      "##pred": 176,
      "##ame": 177,
      "##ict": 178,
      "##predict": 179,
      "##kl": 180,
      "##er": 181,
      "##em": 182,
      "##pkl": 183,
      "##./": 184,
      "##.pkl": 185,
      "##\": \"./": 186,
      "##dev": 187,
      "    \"": 188,
      "        \"": 189,
      "##\",": 190,
      "##\"],\n": 191,
      "##tat": 192,
      "##oc": 193,
      "##s\": [": 194,
      "##lu": 195,
      "##dd": 196,
      "##bedd": 197,
      "##proc": 198,
      "##\"、\"origin": 199,
      "##embedd": 200,
      "##.pkl\",\n": 201,
      "##\", \"": 202,
      "##proces": 203,
      "##embedding": 204,
      "## t": 205,
      "##li": 206,
      "##       }\n": 207,
      "            }": 208,
      "##   {\n": 209,
      "##token_ids": 210,
      "##data_s": 211,
      "##_tokens": 212,
      "##_stat": 213,
      "##map": 214,
      "##process": 215,
      "## th": 216,
      "##data_set": 217,
      "``": 218,
      "##\"train": 219,
      "##name": 220,
      "##ll": 221,
      "##lin": 222,
      "##fr": 223,
      "##us\": [": 224,
      "##_map": 225,
      "##_name": 226,
      "                }\n": 227,
      "            {\n": 228,
      "                \"config": 229,
      "                \"_stat": 230,
      "                \"_name": 231,
      "##label_ids": 232,
      "##, // ": 233,
      "            }, //": 234,
      "```": 235,
      "##us\": [\"train": 236,
      "                \"_status\": [\"train": 237,
      "                \"_name\": \"": 238,
      "##e ": 239,
      "##ns": 240,
      "##all": 241,
      "##y ": 242,
      "##_data": 243,
      "##ver": 244,
      "##', ": 245,
      "##'train": 246,
      "##'dev": 247,
      "            \"": 248,
      "##\": {": 249,
      "##\": \"origin": 250,
      "                    \"de": 251,
      "                    \"data_set": 252,
      "##onlin": 253,
      "##\": ['train": 254,
      "##liver": 255,
      "                \"config\": {\n": 256,
      "##ns \"": 257,
      "##', 'dev": 258,
      "                    \"deliver": 259,
      "                    \"data_set\": ['train": 260,
      "##online": 261,
      "##', 'dev'": 262,
      "                    \"data_set\": ['train', 'dev'": 263,
      "     ": 264,
      "##\"}": 265,
      "##olu": 266,
      "##e\n": 267,
      "##re": 268,
      "##d.": 269,
      "##pd.": 270,
      "##..": 271,
      "##.config": 272,
      "##mns \"": 273,
      "##clu": 274,
      "##colu": 275,
      "##uu": 276,
      "##][": 277,
      "##inclu": 278,
      "##\": pd.": 279,
      "##id\"、\"origin": 280,
      "##datafr": 281,
      "##de th": 282,
      "##\"、\"label": 283,
      "##ese ": 284,
      "##may ": 285,
      "##ame, // ": 286,
      "##predict\", \"": 287,
      "##\", \"predict\", \"": 288,
      "##process.": 289,
      "##_map\": {": 290,
      "                \"_status\": [\"train\", \"predict\", \"": 291,
      "##online\"],\n": 292,
      "                    \"data_set\": ['train', 'dev'],\n": 293,
      "##.config.": 294,
      "##mns \"uu": 295,
      "##columns \"uu": 296,
      "##include th": 297,
      "##\": pd.datafr": 298,
      "##id\"、\"origin\"、\"label": 299,
      "##ese columns \"uu": 300,
      "##may include th": 301,
      "##ame, // may include th": 302,
      "##_map\": {\"": 303,
      "                \"_status\": [\"train\", \"predict\", \"online\"],\n": 304,
      "##\": pd.dataframe, // may include th": 305,
      "##ese columns \"uuid\"、\"origin\"、\"label": 306,
      "##\": pd.dataframe, // may include these columns \"uuid\"、\"origin\"、\"label": 307,
      "##": 308,
      "## e": 309,
      "## f": 310,
      "##\" ": 311,
      "##str": 312,
      "##son": 313,
      "##is": 314,
      "##gat": 315,
      "##le\n": 316,
      "##her": 317,
      "##pa": 318,
      "##ple\n": 319,
      "##xam": 320,
      "##json": 321,
      "##to_data": 322,
      "##tokens": 323,
      "##token_": 324,
      "##\": \"label": 325,
      "                \"data": 326,
      "##   },\n": 327,
      "##_token_ids": 328,
      "```\n": 329,
      "```json": 330,
      "                \"_name\": \"token_": 331,
      "                    \"deliver\": \"": 332,
      "##\"},\n": 333,
      "## exam": 334,
      "##string": 335,
      "##gather": 336,
      "                \"data.": 337,
      "```json\n": 338,
      "## example\n": 339,
      "    }\n": 340,
      "{\n": 341,
      "}\n": 342,
      "## n": 343,
      "## data": 344,
      "## or": 345,
      "## li": 346,
      "## process": 347,
      "##\"label": 348,
      "##\"process.": 349,
      "##t[": 350,
      "##t, ": 351,
      "##od": 352,
      "##om": 353,
      "##sa": 354,
      "##s\"、\"origin": 355,
      "##st, ": 356,
      "##r_token": 357,
      "##r\": {\n": 358,
      "##ir\": {\n": 359,
      "##ar_token": 360,
      "##hod": 361,
      "##har_token": 362,
      "##f,\n": 363,
      "##pu": 364,
      "##mat": 365,
      "##met": 366,
      "##char_token": 367,
      "##us": 368,
      "##_label": 369,
      "##_embedding": 370,
      "##_pa": 371,
      "##_met": 372,
      "##_char_token": 373,
      "##ve": 374,
      "##[..": 375,
      "##'data": 376,
      "##'][": 377,
      "##]][": 378,
      "##2.config.": 379,
      "##$re": 380,
      "            }\n": 381,
      "##\":{\n": 382,
      "##\":\"process.": 383,
      "##inpu": 384,
      "##\": $re": 385,
      "##to_id": 386,
      "##\": \"id": 387,
      "                \"embedding": 388,
      "                \"token_ids": 389,
      "                \"label_ids": 390,
      "##data\": {\n": 391,
      "##data_pa": 392,
      "                        \"": 393,
      "##_idx": 394,
      "##_id_map\": {\"": 395,
      "##tru": 396,
      "                    \"tokens": 397,
      "                    \"data_pa": 398,
      "##ormat": 399,
      "##train\": pd.dataframe, // may include these columns \"uuid\"、\"origin\"、\"label": 400,
      "##\": [\"label": 401,
      "##// ": 402,
      "##\"、\"label_ids": 403,
      "##\": \"./embedding": 404,
      "##\": \"./token_ids": 405,
      "##\": \"./label_ids": 406,
      "##dev\": pd.dataframe, // may include these columns \"uuid\"、\"origin\"、\"label": 407,
      "    \"id": 408,
      "    \"data\": {\n": 409,
      "        \"train\": pd.dataframe, // may include these columns \"uuid\"、\"origin\"、\"label": 410,
      "        \"dev\": pd.dataframe, // may include these columns \"uuid\"、\"origin\"、\"label": 411,
      "##\"、\"origin_token_ids": 412,
      "##_tokens\",\n": 413,
      "##_tokens\"、\"label_ids": 414,
      "## this": 415,
      "##data_set[..": 416,
      "##from": 417,
      "##, // string": 418,
      "                \"_status\": [\"train\"],\n": 419,
      "            \"predict": 420,
      "            \"process.": 421,
      "                    \"deliver_met": 422,
      "        ": 423,
      "        },\n": 424,
      "##..],\n": 425,
      "##_map\": {\"id": 426,
      "## format": 427,
      "                \"_name\": \"token_gather": 428,
      "                    \"deliver\": \"all": 429,
      "## data format": 430,
      "## or li": 431,
      "##t['data": 432,
      "##save": 433,
      "##s\"、\"origin_tokens\"、\"label_ids": 434,
      "##hod\": \"": 435,
      "##_char_token_idx": 436,
      "##'][data_set[..": 437,
      "##input['data": 438,
      "##\": $ref,\n": 439,
      "##to_id\",\n": 440,
      "                \"embedding\": \"./embedding": 441,
      "                \"token_ids\": \"./token_ids": 442,
      "                \"label_ids\": \"./label_ids": 443,
      "                    \"data_pair\": {\n": 444,
      "##\"、\"origin_token_ids\"\n": 445,
      "##from_data": 446,
      "##, // string or li": 447,
      "                    \"deliver_method\": \"": 448,
      "## data format example\n": 449,
      "##s\"、\"origin_tokens\"、\"label_ids\"、\"origin_token_ids\"\n": 450,
      "##input['data'][data_set[..": 451,
      "                \"embedding\": \"./embedding.pkl\",\n": 452,
      "                \"token_ids\": \"./token_ids.pkl\",\n": 453,
      "                \"label_ids\": \"./label_ids.pkl\",\n": 454,
      "##, // string or list, ": 455,
      "        }\n": 456,
      "    {\n": 457,
      "    },\n": 458,
      "## d": 459,
      "## to": 460,
      "## config": 461,
      "## em": 462,
      "## all": 463,
      "## is": 464,
      "## // ": 465,
      "##\", // string or list, ": 466,
      "##tu": 467,
      "##ty ": 468,
      "##t d": 469,
      "##oa": 470,
      "##o this": 471,
      "##ot d": 472,
      "##k\": {\n": 473,
      "##ea": 474,
      "##ew": 475,
      "##e \"": 476,
      "##e_token": 477,
      "##e_map": 478,
      "##n(": 479,
      "##new": 480,
      "##s\",\n": 481,
      "##stat": 482,
      "##s\": \"origin": 483,
      "##spa": 484,
      "##res": 485,
      "##il": 486,
      "##if": 487,
      "##iz": 488,
      "##ill": 489,
      "##get": 490,
      "##loa": 491,
      "##fn(": 492,
      "##d\": {\n": 493,
      "##pty ": 494,
      "##.predict": 495,
      "##.online": 496,
      "##m\n": 497,
      "##mea": 498,
      "##cre": 499,
      "##ctu": 500,
      "##ce_token": 501,
      "##um\n": 502,
      "##_lin": 503,
      "##_to_id\",\n": 504,
      "##will": 505,
      "##4\n": 506,
      "##[input['data'][data_set[..": 507,
      "##]\n": 508,
      "##]=": 509,
      "##])": 510,
      "##]]][": 511,
      "##0 th": 512,
      "##0.config.": 513,
      "##3\n": 514,
      "##5\n": 515,
      "##2\n": 516,
      "##& \"": 517,
      "##-1": 518,
      "##1\n": 519,
      "##ate_map": 520,
      "##\": tru": 521,
      "##ids\": \"origin": 522,
      "##token\": \"origin": 523,
      "##token\"},\n": 524,
      "##token\": \"id": 525,
      "##token_id_map\": {\"": 526,
      "##\": \"token\"},\n": 527,
      "                    }": 528,
      "                    }\n": 529,
      "##_id\"\n": 530,
      "##_id\"],\n": 531,
      "##_id\": tru": 532,
      "                    \"token_ids": 533,
      "                    \"map": 534,
      "                    \"all": 535,
      "                    \"to_data": 536,
      "                    \"from_data": 537,
      "                    \"res": 538,
      "                    \"ids\": \"origin": 539,
      "                    \"token\": \"origin": 540,
      "##, us": 541,
      "##, will": 542,
      "##label\": \"label": 543,
      "##label\": \"id": 544,
      "##label_id_map\": {\"": 545,
      "##label_to_id\",\n": 546,
      "##train\": \"./": 547,
      "##train.pkl\",\n": 548,
      "##train\": {": 549,
      "##train\" ": 550,
      "##train.predict": 551,
      "##\": [..],\n": 552,
      "##_tokens\": [": 553,
      "##_token_map\": {\"id": 554,
      "##origin\": \"origin": 555,
      "##ed\n": 556,
      "##ed data format example\n": 557,
      "##ic_embedding": 558,
      "##predict\"\n": 559,
      "##predict.pkl": 560,
      "##predict\": \"./": 561,
      "##er\"\n": 562,
      "##\": \"./dev": 563,
      "##dev\": \"./dev": 564,
      "    \"embedding": 565,
      "    \"all": 566,
      "    \"token_id_map\": {\"": 567,
      "    \"label_id_map\": {\"": 568,
      "        \"proces": 569,
      "        \"save": 570,
      "        \"loa": 571,
      "        \"_lin": 572,
      "##s\": [\n": 573,
      "##embedding\",\n": 574,
      "            },\n": 575,
      "##token_ids\",\n": 576,
      "##token_ids\":\"process.": 577,
      "##_tokens\"\n": 578,
      "##_tokens\":\"process.": 579,
      "##_tokens\": $ref,\n": 580,
      "##_static_embedding": 581,
      "##process n": 582,
      "##_map\" ": 583,
      "                \"config\":{\n": 584,
      "            }, //4\n": 585,
      "            }, //0 th": 586,
      "            }, //3\n": 587,
      "            }, //5\n": 588,
      "            }, //2\n": 589,
      "            }, //1\n": 590,
      "                \"_name\": \"spa": 591,
      "                \"_name\": \"get": 592,
      "                \"_name\": \"label_to_id\",\n": 593,
      "##e process n": 594,
      "            \"train\": {": 595,
      "##\": \"origin_char_token_idx": 596,
      "##\": \"origin\", // string or list, ": 597,
      "##ns \"train\" ": 598,
      "                    \"data_set\": ['train', 'dev']\n": 599,
      "##\"}\n": 600,
      "##re_embedding": 601,
      "##.config.token_ids\",\n": 602,
      "## fil": 603,
      "##\" mea": 604,
      "##to_data[input['data'][data_set[..": 605,
      "##to_data]=": 606,
      "##tokens\",\n": 607,
      "##\": \"label\",\n": 608,
      "##\": \"label\"},\n": 609,
      "##_token_ids\",\n": 610,
      "                \"_name\": \"token_to_id\",\n": 611,
      "                    \"deliver\": \"embedding\",\n": 612,
      "##string, will": 613,
      "##gather all": 614,
      "                \"data.train\": \"./": 615,
      "                \"data.predict\": \"./": 616,
      "                \"data.dev\": \"./dev": 617,
      "## not d": 618,
      "## process data format example\n": 619,
      "## processed data format example\n": 620,
      "##us, us": 621,
      "##_label_map\": {\"id": 622,
      "##_labels\",\n": 623,
      "##]][from_data": 624,
      "##2.config.token_ids\":\"process.": 625,
      "##2.config.tokens\",\n": 626,
      "                        \"label\": \"label": 627,
      "                        \"origin\": \"origin": 628,
      "##tructu": 629,
      "                    \"tokens\": \"origin\", // string or list, ": 630,
      "                    \"tokens\": \"label\",\n": 631,
      "##\": [\"label\"],\n": 632,
      "##\": [\"label_id\"],\n": 633,
      "##// if": 634,
      "    \"id_token_map\": {\"id": 635,
      "    \"id_label_map\": {\"id": 636,
      "        \"train\": pd.dataframe, // may include these columns \"uuid\"、\"origin\"、\"label\"\n": 637,
      "        \"train\": pd.dataframe, // may include these columns \"uuid\"、\"origin\"、\"labels\"、\"origin_tokens\"、\"label_ids\"、\"origin_token_ids\"\n": 638,
      "        \"dev\": pd.dataframe, // may include these columns \"uuid\"、\"origin\"、\"label\"\n": 639,
      "        \"dev\": pd.dataframe, // may include these columns \"uuid\"、\"origin\"、\"labels\"、\"origin_tokens\"、\"label_ids\"、\"origin_token_ids\"\n": 640,
      "## this is": 641,
      "            \"predict\": {\n": 642,
      "            \"predict.online": 643,
      "            \"process.0.config.": 644,
      "            \"process.2.config.token_ids\":\"process.": 645,
      "        \n": 646,
      "        ],\n": 647,
      "                \"_name\": \"token_gather\",\n": 648,
      "                \"_name\": \"token_gather\"\n": 649,
      "                    \"deliver\": \"all_tokens\",\n": 650,
      "                    \"deliver\": \"all_labels\",\n": 651,
      "##save_tokens\":\"process.": 652,
      "##_char_token_idx\": \"origin_char_token_idx": 653,
      "                    \"deliver_method\": \"new": 654,
      "                    \"deliver_method\": \"cre": 655,
      "##input['data'][data_set[..]][from_data": 656,
      "##, // string or list, to_data[input['data'][data_set[..": 657,
      "## to process data format example\n": 658,
      "## config example\n": 659,
      "## empty ": 660,
      "## // stat": 661,
      "##o this\n": 662,
      "##e \"train.predict": 663,
      "##izer\"\n": 664,
      "##fn(input['data'][data_set[..]][from_data": 665,
      "##ce_tokenizer\"\n": 666,
      "##])\n": 667,
      "##]]][to_data]=": 668,
      "##& \"predict\"\n": 669,
      "##-1.config.token_ids\",\n": 670,
      "##ate_map\"\n": 671,
      "##token\": \"id\"},\n": 672,
      "                    }, // string or list, to_data[input['data'][data_set[..": 673,
      "##_id\": true\n": 674,
      "                    \"token_ids\": $ref,\n": 675,
      "                    \"map_char_token_idx\": \"origin_char_token_idx": 676,
      "                    \"all_tokens\": $ref,\n": 677,
      "                    \"to_data\": [\"label_id\"],\n": 678,
      "                    \"from_data\": [\"label\"],\n": 679,
      "                    \"restructu": 680,
      "                    \"ids\": \"origin_token_ids\",\n": 681,
      "                    \"token\": \"origin_tokens\",\n": 682,
      "##label\": \"id\"}\n": 683,
      "##_tokens\": [..],\n": 684,
      "##predict.pkl\"\n": 685,
      "    \"embedding\": [..],\n": 686,
      "    \"all_tokens\": [..],\n": 687,
      "    \"token_id_map\": {\"token\": \"id\"},\n": 688,
      "    \"label_id_map\": {\"label\": \"id\"}\n": 689,
      "        \"process\": [\n": 690,
      "        \"save\": {\n": 691,
      "        \"load\": {\n": 692,
      "        \"_link\": {\n": 693,
      "##_static_embedding\",\n": 694,
      "##_map\" // if": 695,
      "            }, //0 the process n": 696,
      "                \"_name\": \"space_tokenizer\"\n": 697,
      "                \"_name\": \"get_static_embedding\",\n": 698,
      "            \"train\": { // stat": 699,
      "##ns \"train\" & \"predict\"\n": 700,
      "##re_embedding_id\": true\n": 701,
      "## filed\n": 702,
      "##\" means \"train\" & \"predict\"\n": 703,
      "##string, will not d": 704,
      "##gather all filed\n": 705,
      "                \"data.train\": \"./train.pkl\",\n": 706,
      "                \"data.predict\": \"./predict.pkl\"\n": 707,
      "                \"data.dev\": \"./dev.pkl\",\n": 708,
      "##us, use \"train.predict": 709,
      "                        \"label\": \"label_id\"\n": 710,
      "                        \"origin\": \"origin_tokens\"\n": 711,
      "                    \"tokens\": \"origin\", // string or list, gather all filed\n": 712,
      "    \"id_token_map\": {\"id\": \"token\"},\n": 713,
      "    \"id_label_map\": {\"id\": \"label\"},\n": 714,
      "## this is empty ": 715,
      "            \"predict.online\":{\n": 716,
      "            \"process.0.config.save_tokens\":\"process.": 717,
      "            \"process.2.config.token_ids\":\"process.-1.config.token_ids\",\n": 718,
      "                    \"deliver_method\": \"new\"\n": 719,
      "                    \"deliver_method\": \"create_map\"\n": 720,
      "##fn(input['data'][data_set[..]][from_data])\n": 721,
      "##]]][to_data]=fn(input['data'][data_set[..]][from_data])\n": 722,
      "                    }, // string or list, to_data[input['data'][data_set[..]]][to_data]=fn(input['data'][data_set[..]][from_data])\n": 723,
      "                    \"map_char_token_idx\": \"origin_char_token_idx_map\" // if": 724,
      "                    \"restructure_embedding_id\": true\n": 725,
      "            }, //0 the process num\n": 726,
      "            \"train\": { // status, use \"train.predict": 727,
      "##string, will not do this\n": 728,
      "## this is empty string, will not do this\n": 729,
      "            \"process.0.config.save_tokens\":\"process.2.config.tokens\",\n": 730,
      "                    \"map_char_token_idx\": \"origin_char_token_idx_map\" // if this is empty string, will not do this\n": 731,
      "            \"train\": { // status, use \"train.predict\" means \"train\" & \"predict\"\n": 732
    }
  }
}
