{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "special": true,
      "content": "[UNK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false
    },
    {
      "id": 1,
      "special": true,
      "content": "[CLS]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false
    },
    {
      "id": 2,
      "special": true,
      "content": "[SEP]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false
    },
    {
      "id": 3,
      "special": true,
      "content": "[PAD]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false
    },
    {
      "id": 4,
      "special": true,
      "content": "[MASK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false
    }
  ],
  "normalizer": {
    "type": "Sequence",
    "normalizers": [
      {
        "type": "NFD"
      },
      {
        "type": "Lowercase"
      },
      {
        "type": "StripAccents"
      }
    ]
  },
  "pre_tokenizer": {
    "type": "Sequence",
    "pretokenizers": []
  },
  "post_processor": {
    "type": "TemplateProcessing",
    "single": [
      {
        "SpecialToken": {
          "id": "[CLS]",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      },
      {
        "SpecialToken": {
          "id": "[SEP]",
          "type_id": 0
        }
      }
    ],
    "pair": [
      {
        "SpecialToken": {
          "id": "[CLS]",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      },
      {
        "SpecialToken": {
          "id": "[SEP]",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "B",
          "type_id": 1
        }
      },
      {
        "SpecialToken": {
          "id": "[SEP]",
          "type_id": 1
        }
      }
    ],
    "special_tokens": {
      "[CLS]": {
        "id": "[CLS]",
        "ids": [
          1
        ],
        "tokens": [
          "[CLS]"
        ]
      },
      "[SEP]": {
        "id": "[SEP]",
        "ids": [
          2
        ],
        "tokens": [
          "[SEP]"
        ]
      }
    }
  },
  "decoder": null,
  "model": {
    "type": "Unigram",
    "unk_id": null,
    "vocab": [
      [
        "[UNK]",
        0.0
      ],
      [
        "[CLS]",
        0.0
      ],
      [
        "[SEP]",
        0.0
      ],
      [
        "[PAD]",
        0.0
      ],
      [
        "[MASK]",
        0.0
      ],
      [
        "\n",
        -1.8931085181404672
      ],
      [
        ",",
        -3.053154659279901
      ],
      [
        "            ",
        -3.8290118197158547
      ],
      [
        "        ",
        -4.206710438353964
      ],
      [
        "u",
        -4.2741236157757765
      ],
      [
        "]",
        -4.366853912968713
      ],
      [
        " ",
        -4.429085503714331
      ],
      [
        "           ",
        -4.445243949095073
      ],
      [
        "        \"",
        -4.467603986205495
      ],
      [
        "p",
        -4.518359209731047
      ],
      [
        ".pkl\"",
        -4.576775446007364
      ],
      [
        "\": ",
        -4.586652706506371
      ],
      [
        "\": {",
        -4.590464699466627
      ],
      [
        " {",
        -4.652139998085428
      ],
      [
        "data",
        -4.654100101951341
      ],
      [
        "s",
        -4.678911257628741
      ],
      [
        "{",
        -4.747633113806307
      ],
      [
        "    ",
        -4.7670114623086945
      ],
      [
        "\"",
        -4.814560254233417
      ],
      [
        "                ",
        -4.837491836553069
      ],
      [
        "d",
        -4.863201175185564
      ],
      [
        "    \"data",
        -4.904224777731839
      ],
      [
        "lu",
        -4.926262717371728
      ],
      [
        ".",
        -4.997827563343334
      ],
      [
        "in",
        -5.008098611794302
      ],
      [
        "```",
        -5.011299253764531
      ],
      [
        "de",
        -5.019392194092479
      ],
      [
        "          ",
        -5.021894306594029
      ],
      [
        "ma",
        -5.0284541825084315
      ],
      [
        "       ",
        -5.096054443728905
      ],
      [
        ", // ",
        -5.101773221637359
      ],
      [
        "c",
        -5.158206420533377
      ],
      [
        "         ",
        -5.164278555128228
      ],
      [
        " the",
        -5.2112992537251746
      ],
      [
        "online\"",
        -5.2112992654389885
      ],
      [
        "y ",
        -5.21129927952791
      ],
      [
        "data_set",
        -5.21233493690325
      ],
      [
        "re",
        -5.213424284777683
      ],
      [
        "ns \"",
        -5.218315277911685
      ],
      [
        "['train', 'dev']",
        -5.250813572003424
      ],
      [
        "            \"",
        -5.2942702628123
      ],
      [
        "t",
        -5.302608534412307
      ],
      [
        "i",
        -5.343998807849545
      ],
      [
        "      ",
        -5.358588163330409
      ],
      [
        "tatus\": [\"train\"",
        -5.413258364736953
      ],
      [
        "     ",
        -5.422689468659772
      ],
      [
        "f",
        -5.435628431119571
      ],
      [
        "    }",
        -5.4566482019530405
      ],
      [
        "id\"",
        -5.460200897646242
      ],
      [
        "            }",
        -5.460741811459724
      ],
      [
        "s\"、\"origin_token",
        -5.461299253735638
      ],
      [
        "、\"origin\"、\"label",
        -5.4612992537645315
      ],
      [
        "ame",
        -5.4633571977774755
      ],
      [
        "fr",
        -5.463614488616123
      ],
      [
        "e",
        -5.473159282780283
      ],
      [
        "token_ids",
        -5.512128244272512
      ],
      [
        "le",
        -5.522463534686409
      ],
      [
        "to",
        -5.570217237207784
      ],
      [
        "   ",
        -5.581981177296706
      ],
      [
        "               ",
        -5.61782361090704
      ],
      [
        "\",",
        -5.712742237286285
      ],
      [
        "label",
        -5.72463345501014
      ],
      [
        "a",
        -5.760518240867885
      ],
      [
        "o",
        -5.771799609436818
      ],
      [
        " \"train",
        -5.775450350935477
      ],
      [
        "n",
        -5.776083358410385
      ],
      [
        "j",
        -5.794632587057908
      ],
      [
        "## ",
        -5.794632587097859
      ],
      [
        "x",
        -5.7946325870978646
      ],
      [
        "on",
        -5.798476759081565
      ],
      [
        " \"predict\"",
        -5.8470220364133745
      ],
      [
        "}",
        -5.85281173114565
      ],
      [
        "_s",
        -5.857203374158031
      ],
      [
        "_stat",
        -5.865533369257799
      ],
      [
        "    \"token",
        -5.877558424010044
      ],
      [
        "m",
        -5.879255398925025
      ],
      [
        "_id\"",
        -5.89997598587253
      ],
      [
        "se",
        -5.911772707093542
      ],
      [
        "_ids\": \"./",
        -5.9126480084859745
      ],
      [
        " \"predict",
        -5.915198322751179
      ],
      [
        "embedding",
        -5.9208468490836
      ],
      [
        " f",
        -5.95830385760167
      ],
      [
        "dev\": ",
        -5.989989692893662
      ],
      [
        "train",
        -5.99462527181757
      ],
      [
        "label_ids",
        -5.999427294907483
      ],
      [
        "        }",
        -6.014284508366394
      ],
      [
        "um",
        -6.032990895436416
      ],
      [
        " e",
        -6.054805532543858
      ],
      [
        "        \"_",
        -6.102761085120388
      ],
      [
        "_id",
        -6.124232747783059
      ],
      [
        "_token",
        -6.167829461952239
      ],
      [
        "se ",
        -6.182436386771244
      ],
      [
        "co",
        -6.182859431834039
      ],
      [
        ": \"./",
        -6.2059257377810955
      ],
      [
        "\", \"",
        -6.211246823167108
      ],
      [
        " // ",
        -6.2175588925162675
      ],
      [
        "to_data",
        -6.218418595071373
      ],
      [
        "             ",
        -6.219560245572135
      ],
      [
        "[",
        -6.268924845899932
      ],
      [
        "am",
        -6.273856157139965
      ],
      [
        "r",
        -6.278950788078234
      ],
      [
        "},",
        -6.286750949286046
      ],
      [
        "_ids\"",
        -6.287369459100759
      ],
      [
        ":",
        -6.291081205293427
      ],
      [
        "_map\"",
        -6.294627670291774
      ],
      [
        "liver_method\": \"",
        -6.294632587057909
      ],
      [
        "0",
        -6.294632587057917
      ],
      [
        "w",
        -6.294632587057922
      ],
      [
        "_char_token_idx",
        -6.294632587057922
      ],
      [
        "save",
        -6.29463258705871
      ],
      [
        " this",
        -6.2946325870659505
      ],
      [
        "s\"、\"",
        -6.29463258709673
      ],
      [
        "'][data_set[..]]",
        -6.294632587097791
      ],
      [
        "$",
        -6.29463258709786
      ],
      [
        "1",
        -6.2946325870978646
      ],
      [
        "string or list, ",
        -6.2946325870978646
      ],
      [
        "['",
        -6.294632600676859
      ],
      [
        "_embedding",
        -6.294632607712393
      ],
      [
        "[..]",
        -6.294632869225778
      ],
      [
        "origin_tokens\"",
        -6.294635990570366
      ],
      [
        "\": \"id\"}",
        -6.2946377423700515
      ],
      [
        ".config.",
        -6.2946430914196085
      ],
      [
        "from_data",
        -6.294656803136377
      ],
      [
        "     \"tokens\": \"",
        -6.294657819284339
      ],
      [
        "origin\"",
        -6.294678160534117
      ],
      [
        "tru",
        -6.294735141691244
      ],
      [
        " process ",
        -6.2947520688385
      ],
      [
        "s\":\"process.",
        -6.294966778539534
      ],
      [
        "    \"deliver\": \"",
        -6.295857108733681
      ],
      [
        ".predict\"",
        -6.29681971521969
      ],
      [
        "or",
        -6.298808026071752
      ],
      [
        "label_id",
        -6.299024633419551
      ],
      [
        "token_gather\"",
        -6.299904926228338
      ],
      [
        "mp",
        -6.328767330861006
      ],
      [
        "_map\": {\"id\": \"",
        -6.333480556670383
      ],
      [
        "        },",
        -6.3351739521841335
      ],
      [
        ", \"",
        -6.361169375780342
      ],
      [
        "token",
        -6.363886437015791
      ],
      [
        "\": \"./",
        -6.379166536299655
      ],
      [
        "label\"",
        -6.38451113347333
      ],
      [
        "us\": [\"train\"",
        -6.412982905497472
      ],
      [
        " co",
        -6.436805149498977
      ],
      [
        "    \"id_",
        -6.437478370510345
      ],
      [
        "l",
        -6.455566822904654
      ],
      [
        ", ",
        -6.45907688096992
      ],
      [
        "\"./",
        -6.492839694807103
      ],
      [
        "  ",
        -6.536187164739866
      ],
      [
        "pa",
        -6.56729131173658
      ],
      [
        "\": \"origin",
        -6.57339964057722
      ],
      [
        "    \"label_id",
        -6.634079161210878
      ],
      [
        "        \"process",
        -6.709797070544129
      ],
      [
        "dev",
        -6.728821978968542
      ],
      [
        "2.config.token",
        -6.7399988561865545
      ],
      [
        "\"process.",
        -6.752253604258363
      ],
      [
        "              ",
        -6.757513816898186
      ],
      [
        "t ",
        -6.7852891074776425
      ],
      [
        "     \"_name\": \"",
        -6.785704071311623
      ],
      [
        "train\"",
        -6.822713794611272
      ],
      [
        "       \"config\":",
        -6.833487291361895
      ],
      [
        "      \"_name\": \"",
        -6.840246158575077
      ],
      [
        "ai",
        -6.852249879314874
      ],
      [
        "     \"config\":",
        -6.884557211460486
      ],
      [
        "      \"config\":",
        -6.930705205689374
      ],
      [
        "           \"",
        -6.965029085399937
      ],
      [
        "    \"id",
        -7.000751586713021
      ],
      [
        "\": [",
        -7.033537627718309
      ],
      [
        "ed",
        -7.040926638328212
      ],
      [
        "          \"",
        -7.045585331555559
      ],
      [
        "\"embedding\": ",
        -7.053379113219256
      ],
      [
        "at",
        -7.053993693118415
      ],
      [
        "\": [\"label",
        -7.0616481546630565
      ],
      [
        "         \"",
        -7.0768853357795445
      ],
      [
        "predict",
        -7.08220204580945
      ],
      [
        "    \"_name\": \"",
        -7.104308598785358
      ],
      [
        "process",
        -7.134098753181279
      ],
      [
        "ll ",
        -7.210696760710715
      ],
      [
        "    \"config\":",
        -7.224400429289606
      ],
      [
        "config",
        -7.266123851973387
      ],
      [
        "             \"",
        -7.273947097043047
      ],
      [
        "gather",
        -7.28129896476379
      ],
      [
        "\"_name\": \"token_",
        -7.281894970376938
      ],
      [
        "_id_map\": {\"",
        -7.291429442595458
      ],
      [
        "\"deliver\": \"all_",
        -7.291515566040556
      ],
      [
        "g",
        -7.294579510933254
      ],
      [
        "2",
        -7.294630061337236
      ],
      [
        "status",
        -7.29463237398566
      ],
      [
        "k",
        -7.294632444975376
      ],
      [
        "=",
        -7.29463258709777
      ],
      [
        "(",
        -7.29463258709777
      ],
      [
        "-",
        -7.294632587097841
      ],
      [
        "&",
        -7.2946325870978646
      ],
      [
        ")",
        -7.2946325870978646
      ],
      [
        "4",
        -7.2946325870978646
      ],
      [
        "3",
        -7.2946325870978646
      ],
      [
        "5",
        -7.2946325870978646
      ],
      [
        "z",
        -7.2946325870978646
      ],
      [
        "string",
        -7.29463258913303
      ],
      [
        "\"label\": \"",
        -7.2946557180292135
      ],
      [
        "er\"",
        -7.294750542507543
      ],
      [
        "\"token\": \"",
        -7.294840357711689
      ],
      [
        "all_tokens\"",
        -7.297761202419817
      ],
      [
        "_map\": {\"",
        -7.297857448074833
      ],
      [
        "labels\"",
        -7.3014300067256555
      ],
      [
        "token\"",
        -7.304996780544121
      ],
      [
        "label_id\"",
        -7.313636527820888
      ],
      [
        "is ",
        -7.326656148029468
      ],
      [
        " \"embedding\": ",
        -7.327416477175079
      ],
      [
        "        \"l",
        -7.328636293212038
      ],
      [
        "ne",
        -7.334423417863287
      ],
      [
        "lin",
        -7.342410490295263
      ],
      [
        "      }, //",
        -7.343753736300988
      ],
      [
        "][",
        -7.350789424586132
      ],
      [
        "et",
        -7.351472012473244
      ],
      [
        "ic",
        -7.35524084474125
      ],
      [
        "me",
        -7.3760818925322456
      ],
      [
        "all",
        -7.385777031545025
      ],
      [
        "predict.",
        -7.410207431865611
      ],
      [
        "ce",
        -7.431827017776541
      ],
      [
        "               \"",
        -7.442714795402727
      ],
      [
        "map",
        -7.449902067006667
      ],
      [
        "    }, //",
        -7.463648332813319
      ],
      [
        "       }, //",
        -7.463879810926397
      ],
      [
        "     }, //",
        -7.48314302940061
      ],
      [
        "ct",
        -7.489931517214006
      ],
      [
        "        }, //",
        -7.503059802406298
      ],
      [
        "    },",
        -7.531132973123216
      ],
      [
        "              \"",
        -7.5583076061018435
      ],
      [
        "label_",
        -7.589912948519462
      ],
      [
        "_data\": [\"label",
        -7.611946229949896
      ],
      [
        "\"all_tokens\": ",
        -7.6417145882144695
      ],
      [
        "            },",
        -7.773217639141516
      ],
      [
        "       \"",
        -7.856092537635705
      ],
      [
        " \"all_tokens\": ",
        -7.973487009755525
      ],
      [
        "token_ids\"",
        -8.053465860132267
      ],
      [
        " \"embedding\"",
        -8.13867702580443
      ],
      [
        "_token_ids\"",
        -8.191891521913757
      ],
      [
        "         }, //",
        -8.303616661370778
      ],
      [
        ".2.config.token",
        -8.406076228222055
      ],
      [
        "s\": \"./",
        -8.479251767383605
      ],
      [
        "   \"_name\": \"",
        -8.552804737619004
      ],
      [
        "   }, //",
        -8.570292655439355
      ],
      [
        "embedding\"",
        -8.576280905585428
      ],
      [
        "h",
        -8.609600499447097
      ],
      [
        "#",
        -8.609700499447097
      ],
      [
        "、",
        -8.609800499447097
      ],
      [
        "_",
        -8.609900499447097
      ],
      [
        "y",
        -8.610000499447096
      ],
      [
        "'",
        -8.610100499447096
      ],
      [
        "/",
        -8.610200499447098
      ],
      [
        "`",
        -8.610300499447098
      ],
      [
        "b",
        -8.610400499447097
      ],
      [
        "v",
        -8.610500499447097
      ],
      [
        "      \"",
        -8.610500499447097
      ]
    ]
  }
}